Revit 2026 API

# DirectShapeTypeOptions Class

---

This class is used to control behavior of a DirectShapeType object.

SystemObject Autodesk.Revit.DBDirectShapeTypeOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DirectShapeTypeOptions : IDisposable
```
```vb
Public Class DirectShapeTypeOptions
	Implements IDisposable
```
```cpp
public ref class DirectShapeTypeOptions : IDisposable
```
```fsharp
type DirectShapeTypeOptions =
    class
        interface IDisposable
    end
```

The DirectShapeTypeOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DirectShapeTypeOptions | Constructs a new DirectShapeTypeOptions instance with default settings. |

|  | Name | Description |
| --- | --- | --- |
|  | AllowDuplicateNames | Determines whether or not duplicate DirectShapeType names are allowed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DirectShapeTypeOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqualTo | Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same. |
|  | IsValid | Determines whether a DirectShapeTypeOptions is internally consistent (valid). |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Use Enable/Disable functions to change the default behavior. Use DirectShapeType.SetOptions to modify that object's behavior.

#### Reference

Autodesk.Revit.DB Namespace